<a href="https://colab.research.google.com/github/suraj3004200/data-science/blob/main/P_13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [31]:
import pandas as pd
l1=[['CAR','MARUTI',250000],['TRUCK','VOLVO',1500000],['BIKE','KAWASAKI',350000],['TRUCK','TATA',500000],['TRUCK','ASHOK LEYLAND',600000],['BIKE','YAMAHA',350000],['CAR','KOENISEGG',65000000],['SLIPPERS','RELAXO',5000],['CAR','MERCEDES',2000000],['PHONE','SAMSUNG',25000]]
cold=['CATEGORY','BRAND','PRICE']
df=pd.DataFrame(l1,columns=cold)

In [32]:
df

   CATEGORY          BRAND     PRICE
0       CAR         MARUTI    250000
1     TRUCK          VOLVO   1500000
2      BIKE       KAWASAKI    350000
3     TRUCK           TATA    500000
4     TRUCK  ASHOK LEYLAND    600000
5      BIKE         YAMAHA    350000
6       CAR      KOENISEGG  65000000
7  SLIPPERS         RELAXO      5000
8       CAR       MERCEDES   2000000
9     PHONE        SAMSUNG     25000

In [33]:
grp=df.groupby('CATEGORY')

In [34]:
print(grp["CATEGORY","PRICE"].sum())

             PRICE
CATEGORY
BIKE        700000
CAR       67250000
PHONE        25000
SLIPPERS      5000
TRUCK      2600000

<ipython-input-34-9023a994bad0>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  print(grp["CATEGORY","PRICE"].sum())
<ipython-input-34-9023a994bad0>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(grp["CATEGORY","PRICE"].sum())

In [35]:
print(grp["PRICE"].sum())

CATEGORY
BIKE          700000
CAR         67250000
PHONE          25000
SLIPPERS        5000
TRUCK        2600000
Name: PRICE, dtype: int64

In [36]:
print(grp["PRICE"].mean())

CATEGORY
BIKE        3.500000e+05
CAR         2.241667e+07
PHONE       2.500000e+04
SLIPPERS    5.000000e+03
TRUCK       8.666667e+05
Name: PRICE, dtype: float64

In [39]:
print(grp["PRICE"].sum())

CATEGORY
BIKE          700000
CAR         67250000
PHONE          25000
SLIPPERS        5000
TRUCK        2600000
Name: PRICE, dtype: int64